package 테스트02_문제;
/*
	[문제]
		아래내용을 식으로 작성하고, 답을구하시오.
	[설명]
		철수네 반학생들은 소풍을 나왔다.
		학생수는 전부 24명이고 일부는 동물원관람, 나머지학생은 미술관 관랍을 하였다.
		동물원 입장료는 3000원이고 , 미술관 입장료는 1000원이다.
		학생 24명의 총입장료는 40000원이었다. 
		동물원에 입장한 학생수와 미술관에 입장한 학생수를 각각 구하시오.
		주석으로 표현하시오.
*/
public class 논리연산자3_문제01_동물원요금 {	
	public static void main(String[] args) {		
		/*
		 * [주석]
		 * a+b=24
		 * 3000a+1000b=40000
		 * 3a+b=40
		 * b=40-3a
		 * 40-3a+a=24
		 * -3a=24-40
		 * -3a=16/-3
		 * a=8
		 * b=24-8
		 * b=16
		 * 		a = 8(동물원간 학생수)
		 *      b = 16(미술관간 학생수)
		 *   
		 */
		
	}
}